Sim 01 - WSL/0/air/LAD
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0/air";
    object      LAD;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 -1 0 0 0 0 0];

internalField   nonuniform List<scalar> 
167754
(
0
0
0
0
0
0
0
0
...
)
;

boundaryField
{
    left
    {
        type            slip;
    }
    right
    {
        type            slip;
    }
    back
    {
        type            fixedValue;
        value           uniform 0;
    }
    front
    {
        type            fixedValue;
        value           uniform 0;
    }
    bottom
    {
        type            fixedValue;
        value           uniform 0;
    }
    top
    {
        type            slip;
    }
    buildings
    {
        type            fixedValue;
        value           uniform 0;
    }
}


// ************************************************************************* //
