Sim 01 - WSL/0/air/Tambient
(
(    0   296.45   )
(    3600   298.15   )
(    7200   300.34999999999997   )
);
