Sim 01 - WSL/0/air/cloudCover
(
(    0   0.2   )
(    3600   0   )
(    7200   0   )
);
