Sim 01 - WSL/0/air/w
FoamFile
{
  version    2.0;
  format    ascii;
  class    volScalarField;
  location    "0/air";
  object    w;
}
dimensions    [0 0 0 0 0 0 0];
internalField    uniform 0.0076;
boundaryField
{
  left
  {
    type    slip;
  }
  right
  {
    type    slip;
  }
  top
  {
    type    slip;
  }
  bottom
  {
    type    zeroGradient;
  }
  back
  {
    type    inletOutlet;
    inletValue    uniform 0.0076;
    value    uniform 0.0076;
  }
  front
  {
    type    uniformFixedValue;
    uniformValue    tableFile;
    uniformValueCoeffs
    {
      file    "$FOAM_CASE/0/air/wambient";
    }
    value    uniform 0.0076;
  }
  buildings
  {
    type    compressible::CFDHAMfluidMoistureCoupledImpermeable;
    value    uniform 0.0076;
  }
}
