Sim 01 - WSL/0/vegetation/viewFactorField
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0/vegetation";
    object      viewFactorField;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    left
    {
        type            calculated;
        value           nonuniform List<scalar> 
690
(
1.0587321
1.0587321
1.0587321
1.0587321
1.0587321
1.0587321
1.0587321
1.0587321
...
)
;
    }
    right
    {
        type            calculated;
        value           nonuniform List<scalar> 
690
(
1.0569851
1.0569851
1.0569851
1.0569851
1.0569851
1.0569851
1.0569851
1.0569851
...
)
;
    }
    back
    {
        type            calculated;
        value           nonuniform List<scalar> 
590
(
1.0451151
1.0451151
1.0451151
1.0451151
1.0451151
1.0451151
1.0451151
1.0451151
...
)
;
    }
    front
    {
        type            calculated;
        value           nonuniform List<scalar> 
590
(
1.0510685
1.0510685
1.0510685
1.0510685
1.0510685
1.0510685
1.0510685
1.0510685
...
)
;
    }
    bottom
    {
        type            calculated;
        value           nonuniform List<scalar> 
11248
(
1.0657656
1.0657656
1.0657656
1.0657656
1.0325562
1.0325562
1.0325562
1.0325562
...
)
;
    }
    top
    {
        type            calculated;
        value           nonuniform List<scalar> 
4071
(
1.0349999
1.0349999
1.0349999
1.0349999
1.0349999
1.0349999
1.0349999
1.0349999
...
)
;
    }
    buildings
    {
        type            calculated;
        value           nonuniform List<scalar> 
31731
(
1.0481994
1.1481203
0.92429808
0.50225726
0.80262476
0.43728805
0.53245157
0.89338919
...
)
;
    }
    air_to_vegetation
    {
        type            calculated;
        value           nonuniform List<scalar> 
11145
(
1.1621321
1.169412
1.1255307
1.1549501
1.1137064
1.0683365
1.0871079
1.2722426
...
)
;
    }
}


// ************************************************************************* //
