Sim 01 - WSL/constant/air/momentumTransport
FoamFile
{
  version    2.0;
  format    ascii;
  class    dictionary;
  object    turbulenceProperties;
}
simulationType    RAS;
RAS
{
  RASModel    realizableKE;
  turbulence    on;
  printCoeffs    on;
}
