Sim 01 - WSL/constant/air/thermophysicalProperties
FoamFile
{
  version    2.0;
  format    ascii;
  class    dictionary;
  location    "constant";
  object    thermophysicalProperties;
}
thermoType
{
  type    heRhoThermo;
  mixture    pureMixture;
  transport    const;
  thermo    hConst;
  equationOfState    Boussinesq;
  specie    specie;
  energy    sensibleEnthalpy;
}
mixture
{
  specie
  {
    molWeight    28.96;
  }
  thermodynamics
  {
    Cp    1004.4;
    Hf    0;
  }
  transport
  {
    mu    1.831e-05;
    Pr    0.705;
  }
  equationOfState
  {
    rho0    1.184;
    T0    298.15;
    beta    3e-03;
  }
}
