Sim 01 - WSL/constant/buildings/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     0.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/buildings/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //


3
(
    sides
    {
        type            wall;
        inGroups        List<word> 0();
        nFaces          760;
        startFace       8356;
    }

    buildings_to_air
    {
        type            mappedWall;
        nFaces          364;
        startFace       9116;
        sampleMode      nearestPatchFace;
        sampleRegion    air;
        samplePatch     buildings;
        offsetMode      uniform;
        offset          ( 0 0 0 );
    }

    interior
    {
        type            patch;
        nFaces          364;
        startFace       9480;
    }

)


// ************************************************************************* //
