Sim 01 - WSL/constant/buildings/transportProperties
FoamFile
{
  version    2.0;
  format    ascii;
  class    dictionary;
  location    "constant";
  object    transportProperties;
}
buildingMaterials
(
  {
    name    buildings;
    buildingMaterialModel    Hamstad5Brick;
    rho    1600;
    cap    1000;
    lambda1    0.682;
    lambda2    0;
  }
);
