Sim 01 - WSL/constant/regionProperties
FoamFile
{
  version    2.0;
  format    ascii;
  class    dictionary;
  location    "constant";
  object    regionProperties;
}
regions
(
  fluid (air)
  vegetation (vegetation)
  solid (buildings)
);
