Sim 01 - WSL/constant/vegetation/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     0.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/vegetation/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //


8
(
    left
    {
        type            mappedPatch;
        nFaces          690;
        startFace       576701;
        sampleMode      nearestPatchFace;
        sampleRegion    air;
        samplePatch     left;
        offsetMode      uniform;
        offset          ( 0 0 0 );
    }

    right
    {
        type            mappedPatch;
        nFaces          690;
        startFace       577391;
        sampleMode      nearestPatchFace;
        sampleRegion    air;
        samplePatch     right;
        offsetMode      uniform;
        offset          ( 0 0 0 );
    }

    back
    {
        type            mappedPatch;
        nFaces          590;
        startFace       578081;
        sampleMode      nearestPatchFace;
        sampleRegion    air;
        samplePatch     back;
        offsetMode      uniform;
        offset          ( 0 0 0 );
    }

    front
    {
        type            mappedPatch;
        nFaces          590;
        startFace       578671;
        sampleMode      nearestPatchFace;
        sampleRegion    air;
        samplePatch     front;
        offsetMode      uniform;
        offset          ( 0 0 0 );
    }

    bottom
    {
        type            mappedWall;
        inGroups        List<word> 0();
        nFaces          11248;
        startFace       579261;
        sampleMode      nearestPatchFace;
        sampleRegion    air;
        samplePatch     bottom;
        offsetMode      uniform;
        offset          ( 0 0 0 );
    }

    top
    {
        type            mappedPatch;
        nFaces          4071;
        startFace       590509;
        sampleMode      nearestPatchFace;
        sampleRegion    air;
        samplePatch     top;
        offsetMode      uniform;
        offset          ( 0 0 0 );
    }

    buildings
    {
        type            mappedWall;
        inGroups        List<word> 0();
        nFaces          31731;
        startFace       594580;
        sampleMode      nearestPatchFace;
        sampleRegion    air;
        samplePatch     buildings;
        offsetMode      uniform;
        offset          ( 0 0 0 );
    }

    air_to_vegetation
    {
        type            mappedWall;
        inGroups        List<word> 0();
        nFaces          11145;
        startFace       626311;
        sampleMode      nearestCell;
        sampleRegion    air;
        offsetMode      uniform;
        offset          ( 0 0 0 );
    }

)


// ************************************************************************* //
