Sim 01 - WSL/constant/vegetation/solarLoadFineFaces
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       scalarListList;
    location    "constant/vegetation";
    object      solarLoadFineFaces;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //


3
(

54124
(
214.80245
214.80245
214.80245
214.80245
214.80245
214.80245
214.80245
214.80245
214.80245
214.80245
214.80245
214.80245
214.80245
214.80245
214.80245
214.80245
214.80245
214.80245
214.80245
214.80245
214.80245
214.80245
214.80245
214.80245
214.80245
214.80245
214.80245
214.80245
214.80245
214.80245
214.80245
214.80245
214.80245
214.80245
214.80245
214.80245
214.80245
214.80245
214.80245
214.80245
214.80245
214.80245
214.80245
214.80245
214.80245
214.80245
214.80245
214.80245
214.80245
214.80245
214.80245
214.80245
214.80245
214.80245
214.80245
214.80245
214.80245
214.80245
214.80245
214.80245
214.80245
214.80245
214.80245
214.80245
214.80245
214.80245
214.80245
214.80245
214.80245
214.80245
214.80245
214.80245
214.80245
214.80245
214.80245
214.80245
214.80245
214.80245
214.80245
214.80245
214.80245
214.80245
214.80245
214.80245
214.80245
214.80245
214.80245
214.80245
214.80245
214.80245
214.80245
214.80245
214.80245
214.80245
214.80245
214.80245
214.80245
214.80245
...
)


54124
(
448.43664
448.43664
448.43664
448.43664
448.43664
448.43664
448.43664
448.43664
448.43664
448.43664
448.43664
448.43664
448.43664
448.43664
448.43664
448.43664
448.43664
448.43664
448.43664
448.43664
448.43664
448.43664
448.43664
448.43664
448.43664
448.43664
448.43664
448.43664
448.43664
448.43664
448.43664
448.43664
448.43664
448.43664
448.43664
448.43664
448.43664
448.43664
448.43664
448.43664
448.43664
448.43664
448.43664
448.43664
448.43664
448.43664
448.43664
448.43664
448.43664
448.43664
448.43664
448.43664
448.43664
448.43664
448.43664
448.43664
448.43664
448.43664
448.43664
448.43664
448.43664
448.43664
448.43664
448.43664
448.43664
448.43664
448.43664
448.43664
448.43664
448.43664
448.43664
448.43664
448.43664
448.43664
448.43664
448.43664
448.43664
448.43664
448.43664
448.43664
448.43664
448.43664
448.43664
448.43664
448.43664
448.43664
448.43664
448.43664
448.43664
448.43664
448.43664
448.43664
448.43664
448.43664
448.43664
448.43664
448.43664
448.43664
...
)


54124
(
610.55298
610.55298
610.55298
610.55298
610.55298
610.55298
610.55298
610.55298
610.55298
610.55298
610.55298
610.55298
610.55298
610.55298
610.55298
610.55298
610.55298
610.55298
610.55298
610.55298
610.55298
610.55298
610.55298
610.55298
610.55298
610.55298
610.55298
610.55298
610.55298
610.55298
610.55298
610.55298
610.55298
610.55298
610.55298
610.55298
610.55298
610.55298
610.55298
610.55298
610.55298
610.55298
610.55298
610.55298
610.55298
610.55298
610.55298
610.55298
610.55298
610.55298
610.55298
610.55298
610.55298
610.55298
610.55298
610.55298
610.55298
610.55298
610.55298
610.55298
610.55298
610.55298
610.55298
610.55298
610.55298
610.55298
610.55298
610.55298
610.55298
610.55298
610.55298
610.55298
610.55298
610.55298
610.55298
610.55298
610.55298
610.55298
610.55298
610.55298
610.55298
610.55298
610.55298
610.55298
610.55298
610.55298
610.55298
610.55298
610.55298
610.55298
610.55298
610.55298
610.55298
610.55298
610.55298
610.55298
610.55298
610.55298
...
)

)


// ************************************************************************* //
