Sim 01 - WSL/constant/vegetation/solarLoadProperties
FoamFile
{
  version    2.0;
  format    ascii;
  class    dictionary;
  location    "constant";
  object    solarLoadProperties;
}
solarLoadModel    directAndDiffuse;
directAndDiffuseCoeffs
{
  smoothing    true;
  constantAlbedo    true;
}
solverFreq    1;
solarLoadAbsorptionEmissionModel    none;
solarLoadScatterModel    none;
