Sim 01 - WSL/system/air/changeDictionaryDict
FoamFile
{
  version    2.0;
  format    ascii;
  class    dictionary;
  object    changeDictionaryDict;
}
boundary
{
  buildings
  {
    type    mappedWall;
    sampleMode    nearestPatchFace;
    sampleRegion    buildings;
    samplePatch    buildings_to_air;
    offsetMode    uniform;
    offset    (0 0 0);
  }
}
