Sim 01 - WSL/system/blockMeshDict
FoamFile
{
  version    2.0;
  format    ascii;
  class    dictionary;
  object    blockMeshDict;
}
convertToMeters    1;
vertices
(
  (-307.94293212890625 258.23997497558594 -2.7711166694643907E-13)
  (-307.94293212890625 -335.87255859375 -2.7711166694643907E-13)
  (379.0876159667969 -335.87255859375 -2.7711166694643907E-13)
  (379.0876159667969 258.23997497558594 -2.7711166694643907E-13)
  (-307.94293212890625 258.23997497558594 97.54880142211914)
  (-307.94293212890625 -335.87255859375 97.54880142211914)
  (379.0876159667969 -335.87255859375 97.54880142211914)
  (379.0876159667969 258.23997497558594 97.54880142211914)
);
blocks
(
  hex (0 1 2 3 4 5 6 7)
  (
    59
    69
    10
  )
  simpleGrading (1 1 1)
);
edges
(
);
boundary
(
  left
  {
    type    patch;
    faces
    (
      (0 3 7 4)
    );
  }
  right
  {
    type    patch;
    faces
    (
      (1 5 6 2)
    );
  }
  back
  {
    type    patch;
    faces
    (
      (3 2 6 7)
    );
  }
  front
  {
    type    patch;
    faces
    (
      (0 4 5 1)
    );
  }
  bottom
  {
    type    wall;
    faces
    (
      (0 1 2 3)
    );
  }
  top
  {
    type    patch;
    faces
    (
      (4 7 6 5)
    );
  }
);
mergePatchPairs
(
);
