Sim 01 - WSL/system/buildings/changeDictionaryDict
FoamFile
{
  version    2.0;
  format    ascii;
  class    dictionary;
  object    changeDictionaryDict;
}
boundary
{
  buildings_to_air
  {
    type    mappedWall;
    sampleMode    nearestPatchFace;
    sampleRegion    air;
    samplePatch    buildings;
    offsetMode    uniform;
    offset    (0 0 0);
  }
}
