Sim 01 - WSL/system/vegetation/decomposeParDict
FoamFile
{
  version    2.0;
  format    ascii;
  class    dictionary;
  location    "system";
  object    decomposeParDict;
}
method    scotch;
numberOfSubdomains    10;
scotchCoeffs
{
}
